InformationRegisters/ОчередьСообщенийВ1СДокументооборот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОчередьСообщенийВ1СДокументооборот</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрольОтправкиФайлов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТекстСообщенияОбОшибке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>МоментВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОчередьСообщенийВ1СДокументооборот/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет сообщение в очередь.
//
// Параметры:
//   ДвоичныеДанныеСообщения - ДвоичныеДанные - данные сообщения.
//   КонтрольОтправкиФайлов - см. ИнтеграцияС1СДокументооборотБазоваяФункциональность.КонтрольОтправкиФайлов
//   РеквизитыСообщения - см. РегистрыСведений.ОчередьСообщенийВ1СДокументооборот.РеквизитыСообщения
//
Процедура ДобавитьСообщение(ДвоичныеДанныеСообщения, КонтрольОтправкиФайлов, РеквизитыСообщения = Неопределено) Экспорт
	
	Если РеквизитыСообщения = Неопределено Тогда
		РеквизитыСообщения = РеквизитыСообщения();
	КонецЕсли;
	
	Менеджер = СоздатьМенеджерЗаписи();
	
	Менеджер.МоментВремени = РеквизитыСообщения.МоментВремени;
	Менеджер.Идентификатор = РеквизитыСообщения.Идентификатор;
	Менеджер.Данные = Новый ХранилищеЗначения(ДвоичныеДанныеСообщения, Новый СжатиеДанных(9));
	Менеджер.КонтрольОтправкиФайлов = Новый ХранилищеЗначения(КонтрольОтправкиФайлов);
	Менеджер.ДатаСоздания = ТекущаяДатаСеанса();
	Менеджер.КоличествоПопытокОтправки = РеквизитыСообщения.КоличествоПопытокОтправки;
	Менеджер.ТекстСообщенияОбОшибке = РеквизитыСообщения.ТекстСообщенияОбОшибке;
	
	Менеджер.Записать(Истина);
	
КонецПроцедуры

// Конструктор структуры реквизитов сообщения.
//
// Возвращаемое значение:
//   Структура:
//     * МоментВремени - Число - текущая универсальная дата в миллисекундах.
//     * Идентификатор - УникальныйИдентификатор - идентификатор сообщения.
//     * КоличествоПопытокОтправки - Число - количество попыток отправки сообщения.
//     * ТекстСообщенияОбОшибке - Строка - текст сообщения об ошибке отправки сообщения.
//
Функция РеквизитыСообщения() Экспорт
	
	РеквизитыСообщения = Новый Структура;
	РеквизитыСообщения.Вставить("МоментВремени", ТекущаяУниверсальнаяДатаВМиллисекундах());
	РеквизитыСообщения.Вставить("Идентификатор", Новый УникальныйИдентификатор);
	РеквизитыСообщения.Вставить("КоличествоПопытокОтправки", 0);
	РеквизитыСообщения.Вставить("ТекстСообщенияОбОшибке", "");
	
	Возврат РеквизитыСообщения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
